# 强烈建议修改
LAST_NAME = '刘'  # 姓氏
LAST_NAME_WRITE_NUM = 6  # 姓氏的笔画数
LAST_NAME_WRITE_NUM_FANTI = 15  # 姓氏的笔画数
SEX = '女'  # 孩子性别，男 或者 女
year = 2024  # 出生的时间：年
month = 7  # 出生的时间：月
date = 7  # 出生的时间：日
hour = 7  # 出生的时间：小时
minute = 7  # 出生的时间： 分钟

# 选择性修改
MIN_SINGLE_NUM = 2  # 单个字最少笔画过滤
MAX_SINGLE_NUM = 20  # 单个字最多笔画过滤
THRESHOLD_SCORE = 65  # 三才五格测试最低能接受的得分，结果记录在RESULT_FILE
SELECTED_XITONGSHEN = None  # 已知的喜用神，或者次喜用神。None表示没关系。这个喜用神自己在网站查查，选填，填了可能没有最佳匹配结果
DONT_NEED_WORD = [
    '毓', '赧', '掠', '啦', '站', '凌', '洪', '兮', '疼', '南', '倜', '贴', '烤', '胀', '喔', '贷', '痛', '能', '炽', '恬', '溶', '特', '场', '朕', '缘', '能', '值', '养', '劳', '瑰', '头', '挑', '贷', '之', '胀', '烤', '迅', '嬉', '朔', '端', '纭', '喃', '至', '凉', '烈', '伙', '鸭', '重', '纳', '疾', '套', '宅', '余', '容', '冰', '导', '挺', '乌', '纳', '赵', '淄', '倘', '冻', '徒', '琉', '留', '团', '皖', '套', '俊', '余', '耿', '讨', '肢', '缀', '递', '疾', '氮', '循', '衷', '院', '晋', '嘀', '娘', '二', '三', '领', '嘏', '土', '云', '筠', '曼', '梅', '雪', '珍', '馨', '韵', '纯', '怡', '紫', '慧', '碧', '琇', '淑', '量', '琬', '富', '娜', '恨', '熙', '蕊', '娥', '德', '淳', '寒', '绿', '流', '川', '宫', '栓', '娭', '圬', '途', '绻', '嫩', '疯', '溴', '兀', '寡', '了', '蜥', '旖', '又', '人', '铪', '轻', '嘌', '抢', '入', '赇', '狲', '逑', '己', '逐', '叉', '粹', '乇', '綦', '瑛', '嘛', '孓', '滓', '垫', '铥', '裾', '弓', '舔', '也', '孵', '腑', '溜', '铱', '铨', '尽', '劂', '寸', '熬', '诲', '僦', '颇', '逵', '寥', '闽', '碥', '鸢', '牦', '嫫', '睽', '滀', '嫖', '腓', '誓', '骰', '铷', '榍', '丫', '奁', '郗', '赈', '槊', '菱', '菜', '泛', '腋', '勺', '裹', '蝂', '巾', '悫', '屣', '箬', '呕', '菢', '损', '诶', '铫', '认', '竭', '叹', '铑', '瘥', '搬', '裨', ' 嘏', '郖', '嗽', '辣', '粼', '孑', '腐', '亡', '魂', '力', '丁', '卜', '廑', '匕', '熊', '铒', '乜', '郛', '刁', '僝', '二', '廖', '菟', '榛', '搡', '腌', '裯', '韶', '陎', '菠', '溷', '溯', '溏', '菙', '瘌', '墓', '禊', '铝', '萸', '菏', '菀', '铯', '溦', '台', '华', '殠', '窬', '祸', '脾', '滉', '涤', '溱', '巳', '彳', '才', '大', '凡', '女', '山', '千', '上', '工', '乞', '下', '丸', '久', '丈', '尢', '亍', '丌', '士', '刃', '弋', '币', '裳', '嫡', '沧', '滕', '漓', '瑙', '蜜', '嗾', '稨', '榴', '搪', '猿', '酲', '刀'
]  # 过滤掉包含这些字的名字

# 尽量别改，除非你知道是什么意思
debug = False
my_write_num_list = [(7, 10)]  # 经过第一轮测试后笔画的结果， 自己记录下来
true_request = True  # 真实请求测试
# 名字固定要的字
fix_write_word = '宸'
SELECTED_SANCAI = ['大吉', '中吉', '吉']  # 三才中，如果为None就不特意选最好的

# 首先在http://www.qimingzi.net/ 网站提交基本信息，点击开始起名，F12查看请求信息把Cookie复制下来

headers = {"Cookie": "51cke__=; ASP.NET_SessionId=kr31woivog1u1lyobmxmjcx0; Hm_lvt_1f1b125fd1b03fdb6cac5abdd0f5d306=1720593970; HMACCOUNT=3EA42168B79EA1C7; 53gid2=12719256835005; 53gid0=12719256835005; 53gid1=12719256835005; 53revisit=1720607182644; 53kf_72241622_from_host=www.qimingzi.net; 53kf_72241622_keyword=; uuid_53kf_72241622=60d958f51bf3066b46008c7a02baa2a1; 53kf_72241622_land_page=http%253A%252F%252Fwww.qimingzi.net%252FsimpleReport.aspx%253Fsurname%253D; kf_72241622_land_page_ok=1; 53uvid=1; onliner_zdfq72241622=0; visitor_type=old; __tins__20674741=%7B%22sid%22%3A%201720609577345%2C%20%22vd%22%3A%201%2C%20%22expires%22%3A%201720611377345%7D; Hm_lpvt_1f1b125fd1b03fdb6cac5abdd0f5d306=1720609578; __tins__5033285=%7B%22sid%22%3A%201720608828418%2C%20%22vd%22%3A%203%2C%20%22expires%22%3A%201720611377585%7D; __51laig__=16",
           "User-Agent": "Mozilla/5.0 (Windows NT 10.0; WOW64; rv:61.0) Gecko/20100101 Firefox/61.0"}
